
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |           1 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                         |
|:--------:|:--------------------------------------------------------------------------------------------------|
|    🟢    | `aws_iam_policy.jumphost-assume`                                                                  |
|    🟢    | `module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["jumphost-assume"]` |
|    🟡    | `module.infrahouse-github-backup-app-key.aws_secretsmanager_secret_version.current`               |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_policy.jumphost-assume will be created
  + resource "aws_iam_policy" "jumphost-assume" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow jumphost assume roles"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "jumphost-assume"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
        }
    }

  # module.infrahouse-github-backup-app-key.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/infrahouse-github-backup-app-key/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:infrahouse-github-backup20241008175604274900000001-WxRbWT",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.infrahouse-github-backup-app-key.aws_secretsmanager_secret_version.current will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "current" {
        id             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:infrahouse-github-backup20241008175604274900000001-WxRbWT|terraform-20241008175605117400000003"
      ~ version_stages = [
          - "AWSPREVIOUS",
            # (1 unchanged element hidden)
        ]
        # (5 unchanged attributes hidden)
    }

  # module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.extra["jumphost-assume"] will be created
  + resource "aws_iam_role_policy_attachment" "extra" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "jumphost-Zv01ElhajbB620240223005112032800000005"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDB9fQ==
```
</details>